burakenez/gd32e502-demo-suites-cmake-vscode/Drivers/GD32E502_standard_peripheral/Include/gd32e502_adc.h
/* ADC_IOFFx x=0..3 */
#define ADC_IOFFX_IOFF                  BITS(0, 11)                      /*!< data offset for inserted channel x */

/* ADC_WDHT */
#define ADC_WDHT0_WDHT0                 BITS(0, 11)                      /*!< analog watchdog 0 high threshold */

/* ADC_WDLT */
#define ADC_WDLT0_WDLT0                 BITS(0, 11)                      /*!< analog watchdog 0 low threshold */

/* ADC_RSQx x=0..2 */
#define ADC_RSQX_RSQN                   BITS(0, 4)                       /*!< n conversion in regular sequence */
#define ADC_RSQ0_RL                     BITS(20, 23)                     /*!< regular channel sequence length */

/* ADC_ISQ */
#define ADC_ISQ_ISQN                    BITS(0, 4)                       /*!< n conversion in regular sequence */
#define ADC_ISQ_IL                      BITS(20, 21)                     /*!< inserted sequence length */

/* ADC_IDATAx x=0..3 */
#define ADC_IDATAX_IDATAN               BITS(0, 15)                      /*!< inserted channel x conversion data  */

/* ADC_RDATA */
#define ADC_RDATA_RDATA                 BITS(0, 15)                      /*!< regular data */
#define ADC_RDATA_ADC1RDTR              BITS(16, 31)                     /*!< ADC1 regular channel data */

/* ADC_OVSAMPCTL */
#define ADC_OVSAMPCTL_OVSEN             BIT(0)                           /*!< oversampling enable */
#define ADC_OVSAMPCTL_OVSR              BITS(2, 4)                       /*!< oversampling ratio */
#define ADC_OVSAMPCTL_OVSS              BITS(5, 8)                       /*!< oversampling shift */
#define ADC_OVSAMPCTL_TOVS              BIT(9)                           /*!< triggered oversampling */
#define ADC_OVSAMPCTL_DRES              BITS(12, 13)                     /*!< ADC resolution */

/* ADC_WD1SR */
#define ADC_WD1SR_AWD1CS                BITS(0, 17)                      /*!< analog watchdog 1 channel selection */

/* ADC_WDT1 */
#define ADC_WDT1_WDLT1                  BITS(0, 7)                       /*!< analog watchdog 1 low threshold */
#define ADC_WDT1_WDHT1                  BITS(16, 23)                     /*!< analog watchdog 1 high threshold */

/* constants definitions */
/* ADC flag definitions */
#define ADC_FLAG_WDE0                            ADC_STAT_WDE0                               /*!< analog watchdog 0 event flag */
#define ADC_FLAG_EOC                             ADC_STAT_EOC                                /*!< end of conversion */
#define ADC_FLAG_EOIC                            ADC_STAT_EOIC                               /*!< inserted channel end of conversion */
#define ADC_FLAG_STIC                            ADC_STAT_STIC                               /*!< inserted channel start flag */
#define ADC_FLAG_STRC                            ADC_STAT_STRC                               /*!< regular channel start flag */
#define ADC_FLAG_WDE1                            ADC_STAT_WDE1                               /*!< analog watchdog 1 event flag */

/* configure number of conversions in discontinuous mode */
#define CTL0_DISNUM(regval)                      (BITS(13, 15) & ((uint32_t)(regval) << 13)) /*!< write value to ADC_CTL0_DISNUM bit field */

/* ADC special function definitions */
#define ADC_SCAN_MODE                            ADC_CTL0_SM                                 /*!< scan mode */
#define ADC_INSERTED_CHANNEL_AUTO                ADC_CTL0_ICA                                /*!< inserted channel group convert automatically */
#define ADC_CONTINUOUS_MODE                      ADC_CTL1_CTN                                /*!< continuous mode */

/* ADC synchronization mode */
#define CTL0_SYNCM(regval)                       (BITS(16, 19) & ((uint32_t)(regval) << 16)) /*!< write value to ADC_CTL0_SYNCM bit field */
#define ADC_MODE_FREE                                        CTL0_SYNCM(0)                   /*!< all the ADCs work independently */
#define ADC_DAUL_REGULAL_PARALLEL_INSERTED_PARALLEL          CTL0_SYNCM(1)                   /*!< ADC0 and ADC1 work in combined regular parallel + inserted parallel mode */
#define ADC_DAUL_REGULAL_PARALLEL_INSERTED_ROTATION          CTL0_SYNCM(2)                   /*!< ADC0 and ADC1 work in combined regular parallel + trigger rotation mode */
#define ADC_DAUL_INSERTED_PARALLEL_REGULAL_FOLLOWUP_FAST     CTL0_SYNCM(3)                   /*!< ADC0 and ADC1 work in combined inserted parallel + follow-up fast mode */
#define ADC_DAUL_INSERTED_PARALLEL_REGULAL_FOLLOWUP_SLOW     CTL0_SYNCM(4)                   /*!< ADC0 and ADC1 work in combined inserted parallel + follow-up slow mode */
#define ADC_DAUL_INSERTED_PARALLEL                           CTL0_SYNCM(5)                   /*!< ADC0 and ADC1 work in inserted parallel mode only */
#define ADC_DAUL_REGULAL_PARALLEL                            CTL0_SYNCM(6)                   /*!< ADC0 and ADC1 work in regular parallel mode only */
#define ADC_DAUL_REGULAL_FOLLOWUP_FAST                       CTL0_SYNCM(7)                   /*!< ADC0 and ADC1 work in follow-up fast mode only */
#define ADC_DAUL_REGULAL_FOLLOWUP_SLOW                       CTL0_SYNCM(8)                   /*!< ADC0 and ADC1 work in follow-up slow mode only */
#define ADC_DAUL_INSERTED_TRRIGGER_ROTATION                  CTL0_SYNCM(9)                   /*!< ADC0 and ADC1 work in trigger rotation mode only */

/* ADC data alignment */
#define ADC_DATAALIGN_RIGHT                      ((uint32_t)0x00000000U)                     /*!< LSB alignment */
#define ADC_DATAALIGN_LEFT                       ADC_CTL1_DAL                                /*!< MSB alignment */

/* ADC external trigger select for regular channel */
#define ADC0_1_EXTTRIG_REGULAR_TRIGSEL           ((uint32_t)0x00000000U)                     /*!< TRIGSEL trigger */
#define ADC0_1_EXTTRIG_REGULAR_NONE              ADC_CTL1_ETSRC                              /*!< software trigger */

/* ADC external trigger select for inserted channel */
#define ADC0_1_EXTTRIG_INSERTED_TRIGSEL          ((uint32_t)0x00000000U)                     /*!< TRIGSEL trigger */
#define ADC0_1_EXTTRIG_INSERTED_NONE             ADC_CTL1_ETSIC                              /*!< software trigger */

/* ADC_SAMPTX register value */
#define SAMPTX_SPT(regval)                       (BITS(0, 2) & ((uint32_t)(regval) << 0))    /*!< write value to ADC_SAMPTX_SPT bit field */
#define ADC_SAMPLETIME_2POINT5                   SAMPTX_SPT(0)                               /*!< 2.5 sampling cycles */
#define ADC_SAMPLETIME_14POINT5                  SAMPTX_SPT(1)                               /*!< 14.5 sampling cycles */
#define ADC_SAMPLETIME_27POINT5                  SAMPTX_SPT(2)                               /*!< 27.5 sampling cycles */
#define ADC_SAMPLETIME_55POINT5                  SAMPTX_SPT(3)                               /*!< 55.5 sampling cycles */
#define ADC_SAMPLETIME_83POINT5                  SAMPTX_SPT(4)                               /*!< 83.5 sampling cycles */
#define ADC_SAMPLETIME_111POINT5                 SAMPTX_SPT(5)                               /*!< 111.5 sampling cycles */
#define ADC_SAMPLETIME_143POINT5                 SAMPTX_SPT(6)                               /*!< 143.5 sampling cycles */
#define ADC_SAMPLETIME_479POINT5                 SAMPTX_SPT(7)                               /*!< 479.5 sampling cycles */

/* ADC data offset for inserted channel x */
#define IOFFX_IOFF(regval)                       (BITS(0, 11) & ((uint32_t)(regval) << 0))

/* ADC analog watchdog 0 high threshold */
#define WDHT0_WDHT0(regval)                      (BITS(0, 11) & ((uint32_t)(regval) << 0))

/* ADC analog watchdog 0 low  threshold */
#define WDLT0_WDLT0(regval)                      (BITS(0, 11) & ((uint32_t)(regval) << 0))

/* ADC analog watchdog 1 high threshold */
#define WDT1_WDHT1(regval)                       (BITS(16, 23) & ((uint32_t)(regval) << 16))

